# GroupBy III

In [0]:
import pandas as pd

### Use Case: statistics on test Scores.

In [0]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [3]:
regiment = pd.DataFrame(raw_data, columns = raw_data.keys())
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### What is the mean preTestScore from the regiment Nighthawks?

In [13]:
regiment[regiment.regiment=="Nighthawks"].preTestScore.mean()

15.25

### Compute simple statistics (mean, std, min, max, quantiles) by company

In [15]:
regiment.groupby("company").agg(["mean","std","min","max","quantile"])

        preTestScore                     ... postTestScore
                mean        std min max  ...           std min max quantile
company                                  ...
1st         6.666667   8.524475   2  24  ...     27.485754  25  94     66.0
2nd        15.500000  14.652645   2  31  ...     14.057027  57  94     62.0

[2 rows x 10 columns]

### What is the mean each company's preTestScore?

In [19]:
regiment.groupby("company").preTestScore.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Present the mean preTestScores grouped by regiment and company

In [25]:
regiment.groupby(["regiment", "company"]).preTestScore.mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [41]:
a = regiment.groupby(["regiment", "company"]).preTestScore.mean()
a.reindex([("Nighthawks","1st"), ("Nighthawks","2nd"), ("Scouts","2nd"), ("Scouts","1st"), ("Dragoons","1st"), ("Dragoons","2nd")])

regiment    company
Nighthawks  1st        14.0
            2nd        16.5
Scouts      2nd         2.5
            1st         2.5
Dragoons    1st         3.5
            2nd        27.5
Name: preTestScore, dtype: float64

### Group the entire dataframe by regiment and company

In [43]:
regiment.groupby(["regiment","company"])

###  What is the number of observations in each regiment and company

In [46]:
regiment.groupby(["regiment","company"])["name"].count()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
Name: name, dtype: int64

### Iterate over a group and print the name and the whole data from the regiment

In [48]:
grouped = regiment.groupby("regiment")
for name, group in grouped:
  print(name)
  print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70